In [3]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine

In [4]:
# DB 커넥션 열기
engine = create_engine('mysql+pymysql://kopo:kopo1234@kopo2.cf0xvfbyuytw.us-east-1.rds.amazonaws.com:3306/kopo')

In [5]:
# DB 테이블을 읽어 Data Frame 변수에 저장하기
storeData = pd.read_sql_query('SELECT * FROM store_location', engine)
storeData.head()

                  cs_name         lng        lat
0  coffeekorea_seulleng93  127.047883  37.505675
1                 propose  126.899220  37.471711
2    singsingcoffee_toast  128.980455  35.159774
3            warawara_hof  127.061026  37.493922
4                    test  126.715710  37.460813